Обработки/Reports/_СЧА_ФОГФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СЧА_ФОГФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СЧА_ФОГФ/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Стоимость чистых активов ФОГФ",
		"1.10",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	Если Не ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет предназначен только для счетов ДУ с видом 'Управление активами ФОГФ'");
		Возврат;
	КонецЕсли;
			
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
				
	Если Не ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ответственный");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.КонтактноеЛицо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ответственный");
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхГлБухгалтера = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлБухгалтера", СтруктураДанныхГлБухгалтера);
				
	Если Не ЗначениеЗаполнено(СтруктураДанныхГлБухгалтера) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран главный бухгалтер");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(СтруктураДанныхГлБухгалтера.КонтактноеЛицо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран главный бухгалтер");
		Возврат;
	КонецЕсли;

	// Получим даты СЧА на начало и конец периода
	ТекДатаНачала		= НачалоДня(ЭтотОбъект.Период.ДатаНачала-1);
	ТекДатаОкончания 	= НачалоДня(ЭтотОбъект.Период.ДатаОкончания);
		
	ДатаСЧАНаНачалоПериода = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ТекДатаНачала);
	ДатаСЧАНаКонецПериода = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ТекДатаОкончания);

	Если ДатаСЧАНаНачалоПериода = Неопределено Или ДатаСЧАНаКонецПериода = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет не сформирован");	
		Возврат;
	КонецЕсли; 	
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления"); 	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	Макет = ПолучитьМакет("Макет");
	ОбластьСекция_1 = Макет.ПолучитьОбласть("Секция_1");
	ОбластьСекция_2 = Макет.ПолучитьОбласть("Секция_2");
	ОбластьБрокеры  = Макет.ПолучитьОбласть("Брокеры");
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
		
	Запрос = Новый Запрос;	
	
	#ОБЛАСТЬ ТЕКСТ_ЗАПРОСА
	
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ПОМЕСТИТЬ _СчетаДоверительногоУправления
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток КАК БалансоваяСтоимостьБезНКД,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток КАК Переоценка,
	|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК НКДУплаченныйНачисленный,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток < 0
	|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Дисконт,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток > 0
	|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Премия,
	|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток КАК Корректировка,
	|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение
	|ПОМЕСТИТЬ _ЦенныеБумагиСПартиями_НачалоПериода
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&ДатаНачала,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = &ВидУчетаБаланс
	|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))) КАК БухПартииЦенныхБумагОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага,
	|	0,
	|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаНаБалансеОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
	|			&ДатаНачала,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = &ВидУчетаБаланс
	|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))) КАК БухПартииЦенныхБумагКПолучениюОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) КАК БалансоваяСтоимостьБезНКД,
	|	СУММА(_ЦенныеБумаги.Переоценка) КАК Переоценка,
	|	СУММА(_ЦенныеБумаги.НКДУплаченныйНачисленный) КАК НКДУплаченныйНачисленный,
	|	СУММА(_ЦенныеБумаги.Дисконт) КАК Дисконт,
	|	СУММА(_ЦенныеБумаги.Премия) КАК Премия,
	|	СУММА(_ЦенныеБумаги.Корректировка) КАК Корректировка,
	|	СУММА(_ЦенныеБумаги.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение
	|ПОМЕСТИТЬ _ЦенныеБумаги_НачалоПериода
	|ИЗ
	|	_ЦенныеБумагиСПартиями_НачалоПериода КАК _ЦенныеБумаги
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЦенныеБумаги.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕСТЬNULL(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД, 0) + ЕСТЬNULL(_ЦенныеБумаги.Переоценка, 0) + ЕСТЬNULL(_ЦенныеБумаги.НКДУплаченныйНачисленный, 0) + ЕСТЬNULL(_ЦенныеБумаги.Дисконт, 0) + ЕСТЬNULL(_ЦенныеБумаги.Премия, 0) + ЕСТЬNULL(_ЦенныеБумаги.Корректировка, 0) - ЕСТЬNULL(_ЦенныеБумаги.СуммаРезервовПодОбесценение, 0)) КАК БалансоваяСумма
	|ПОМЕСТИТЬ _БалансоваяСтоимостьЦБ_НачалоПериода
	|ИЗ
	|	_ЦенныеБумаги_НачалоПериода КАК _ЦенныеБумаги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток КАК БалансоваяСтоимостьБезНКД,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток КАК Переоценка,
	|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК НКДУплаченныйНачисленный,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток < 0
	|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Дисконт,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток > 0
	|			ТОГДА БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Премия,
	|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток КАК Корректировка,
	|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение
	|ПОМЕСТИТЬ _ЦенныеБумагиСПартиями_КонецПериода
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&ДатаОкончания_Граница,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = &ВидУчетаБаланс
	|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))) КАК БухПартииЦенныхБумагОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага,
	|	0,
	|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаНаБалансеОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
	|			&ДатаОкончания_Граница,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = &ВидУчетаБаланс
	|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))) КАК БухПартииЦенныхБумагКПолучениюОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) КАК БалансоваяСтоимостьБезНКД,
	|	СУММА(_ЦенныеБумаги.Переоценка) КАК Переоценка,
	|	СУММА(_ЦенныеБумаги.НКДУплаченныйНачисленный) КАК НКДУплаченныйНачисленный,
	|	СУММА(_ЦенныеБумаги.Дисконт) КАК Дисконт,
	|	СУММА(_ЦенныеБумаги.Премия) КАК Премия,
	|	СУММА(_ЦенныеБумаги.Корректировка) КАК Корректировка,
	|	СУММА(_ЦенныеБумаги.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение
	|ПОМЕСТИТЬ _ЦенныеБумаги_КонецПериода
	|ИЗ
	|	_ЦенныеБумагиСПартиями_КонецПериода КАК _ЦенныеБумаги
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЦенныеБумаги.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕСТЬNULL(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД, 0) + ЕСТЬNULL(_ЦенныеБумаги.Переоценка, 0) + ЕСТЬNULL(_ЦенныеБумаги.НКДУплаченныйНачисленный, 0) + ЕСТЬNULL(_ЦенныеБумаги.Дисконт, 0) + ЕСТЬNULL(_ЦенныеБумаги.Премия, 0) + ЕСТЬNULL(_ЦенныеБумаги.Корректировка, 0) - ЕСТЬNULL(_ЦенныеБумаги.СуммаРезервовПодОбесценение, 0)) КАК БалансоваяСумма
	|ПОМЕСТИТЬ _БалансоваяСтоимостьЦБ_КонецПериода
	|ИЗ
	|	_ЦенныеБумаги_КонецПериода КАК _ЦенныеБумаги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(-ВЫБОР
	|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
	|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|							И НЕ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОшибочноЗачисленные), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами))
	|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
	|				ТОГДА ВЫБОР
	|						КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|							ТОГДА -ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|						ИНАЧЕ ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ + ВЫБОР
	|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
	|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|							И НЕ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратОшибочноЗачисленных))
	|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
	|				ТОГДА ВЫБОР
	|						КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|							ТОГДА -ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|						ИНАЧЕ ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(-ВЫБОР
	|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
	|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|							И НЕ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОшибочноЗачисленные), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами))
	|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
	|				ТОГДА ВЫБОР
	|						КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|							ТОГДА -ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|						ИНАЧЕ ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПоступлениеАктивов,
	|	СУММА(ВЫБОР
	|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
	|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|							И НЕ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратОшибочноЗачисленных))
	|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
	|				ТОГДА ВЫБОР
	|						КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|							ТОГДА -ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|						ИНАЧЕ ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИзъятиеАктивов,
	|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ПОМЕСТИТЬ _ВводыВыводы
	|ИЗ
	|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК Сумма
	|ПОМЕСТИТЬ _СтоимостьПереоценки_НачалоПериода
	|ИЗ
	|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
	|ГДЕ
	|	СтоимостьПереоценки.Период = НАЧАЛОПЕРИОДА(&ДатаСЧАНаНачалоПериода, ДЕНЬ)
	|	И СтоимостьПереоценки.Организация = &Организация
	|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК Сумма
	|ПОМЕСТИТЬ _СтоимостьПереоценки_КонецПериода
	|ИЗ
	|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
	|ГДЕ
	|	СтоимостьПереоценки.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|	И СтоимостьПереоценки.Организация = &Организация
	|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СубъектАналитики,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				ТОГДА -СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
	|			ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
	|		КОНЕЦ) КАК Сумма,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта
	|ПОМЕСТИТЬ _АктивыНеЦБ_КонецПериода
	|ИЗ
	|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
	|ГДЕ
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
	|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &ДатаСЧАНаКонецПериода
	|	И НЕ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И (ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего))
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СубъектАналитики,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				ТОГДА -СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
	|			ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
	|		КОНЕЦ) КАК Сумма,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта
	|ПОМЕСТИТЬ _АктивыНеЦБ_НачалоПериода
	|ИЗ
	|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
	|ГДЕ
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
	|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &ДатаСЧАНаНачалоПериода
	|	И НЕ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И (ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего))
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|				ИЛИ _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныеСредства_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|				И _АктивыНеЦБ_НачалоПериода.Валюта = &ВалютаУчета
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныеСредстваРуб_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|				И _АктивыНеЦБ_НачалоПериода.Валюта <> &ВалютаУчета
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныеСредстваВал_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Депозиты_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДебиторскаяЗадолженность_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|				И ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации))
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗадолженностьПоЦБ_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|				И ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи))
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентыИДивиденды_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|				И ТИПЗНАЧЕНИЯ(_АктивыНеЦБ_НачалоПериода.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстаткиУБрокеров_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|				И НЕ(ТИПЗНАЧЕНИЯ(_АктивыНеЦБ_НачалоПериода.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
	|						ИЛИ ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)))
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрочаяДебиторскаяЗадолженность_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИтогоАктивов_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КредиторскаяЗадолженность_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И (ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВознаграждениеУК_НачалоПериода,
	|	0 КАК ВозвратСредствУчредителю_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И (ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КредиторскаяЗадолженностьПоЦБ_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И (ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Комиссия))
	|					ИЛИ (ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего))
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОплатаРасходовДУ_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И НЕ(ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Комиссия))
	|						ИЛИ (ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего)
	|						ИЛИ ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)))
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрочаяКредиторскаяЗадолженность_НачалоПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|			ТОГДА _АктивыНеЦБ_НачалоПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИтогоПассивов_НачалоПериода
	|ПОМЕСТИТЬ _РаспределениеНеЦБ_НачалоПериода
	|ИЗ
	|	_АктивыНеЦБ_НачалоПериода КАК _АктивыНеЦБ_НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ДенежныеСредства_НачалоПериода) КАК ДенежныеСредства_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ДенежныеСредстваРуб_НачалоПериода) КАК ДенежныеСредстваРуб_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ДенежныеСредстваВал_НачалоПериода) КАК ДенежныеСредстваВал_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.Депозиты_НачалоПериода) КАК Депозиты_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ДебиторскаяЗадолженность_НачалоПериода) КАК ДебиторскаяЗадолженность_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ЗадолженностьПоЦБ_НачалоПериода) КАК ЗадолженностьПоЦБ_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ПроцентыИДивиденды_НачалоПериода) КАК ПроцентыИДивиденды_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ОстаткиУБрокеров_НачалоПериода) КАК ОстаткиУБрокеров_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ПрочаяДебиторскаяЗадолженность_НачалоПериода) КАК ПрочаяДебиторскаяЗадолженность_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ИтогоАктивов_НачалоПериода) КАК ИтогоАктивов_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.КредиторскаяЗадолженность_НачалоПериода) КАК КредиторскаяЗадолженность_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ВознаграждениеУК_НачалоПериода) КАК ВознаграждениеУК_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ВозвратСредствУчредителю_НачалоПериода) КАК ВозвратСредствУчредителю_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.КредиторскаяЗадолженностьПоЦБ_НачалоПериода) КАК КредиторскаяЗадолженностьПоЦБ_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ОплатаРасходовДУ_НачалоПериода) КАК ОплатаРасходовДУ_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ПрочаяКредиторскаяЗадолженность_НачалоПериода) КАК ПрочаяКредиторскаяЗадолженность_НачалоПериода,
	|	СУММА(_РаспределениеНеЦБ_НачалоПериода.ИтогоПассивов_НачалоПериода) КАК ИтогоПассивов_НачалоПериода
	|ПОМЕСТИТЬ _РаспределениеНеЦБ_НачалоПериода_Итоги
	|ИЗ
	|	_РаспределениеНеЦБ_НачалоПериода КАК _РаспределениеНеЦБ_НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|				ИЛИ _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныеСредства_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|				И _АктивыНеЦБ_КонецПериода.Валюта = &ВалютаУчета
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныеСредстваРуб_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|				И _АктивыНеЦБ_КонецПериода.Валюта <> &ВалютаУчета
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныеСредстваВал_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Депозиты_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДебиторскаяЗадолженность_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|				И ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации))
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗадолженностьПоЦБ_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|				И ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи))
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентыИДивиденды_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|				И ТИПЗНАЧЕНИЯ(_АктивыНеЦБ_КонецПериода.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстаткиУБрокеров_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|				И НЕ(ТИПЗНАЧЕНИЯ(_АктивыНеЦБ_КонецПериода.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
	|						ИЛИ ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)))
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрочаяДебиторскаяЗадолженность_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИтогоАктивов_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КредиторскаяЗадолженность_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И (ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВознаграждениеУК_КонецПериода,
	|	0 КАК ВозвратСредствУчредителю_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И (ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КредиторскаяЗадолженностьПоЦБ_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И (ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Комиссия))
	|					ИЛИ (ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего))
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОплатаРасходовДУ_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И НЕ(ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Комиссия))
	|						ИЛИ (ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего)
	|						ИЛИ ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.ВидЗадолженности КАК Справочник.ВидыЗадолженности) В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)))
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрочаяКредиторскаяЗадолженность_КонецПериода,
	|	ВЫБОР
	|		КОГДА _АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|			ТОГДА _АктивыНеЦБ_КонецПериода.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИтогоПассивов_КонецПериода
	|ПОМЕСТИТЬ _РаспределениеНеЦБ_КонецПериода
	|ИЗ
	|	_АктивыНеЦБ_КонецПериода КАК _АктивыНеЦБ_КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ДенежныеСредства_КонецПериода) КАК ДенежныеСредства_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ДенежныеСредстваРуб_КонецПериода) КАК ДенежныеСредстваРуб_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ДенежныеСредстваВал_КонецПериода) КАК ДенежныеСредстваВал_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.Депозиты_КонецПериода) КАК Депозиты_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ДебиторскаяЗадолженность_КонецПериода) КАК ДебиторскаяЗадолженность_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ЗадолженностьПоЦБ_КонецПериода) КАК ЗадолженностьПоЦБ_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ПроцентыИДивиденды_КонецПериода) КАК ПроцентыИДивиденды_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ОстаткиУБрокеров_КонецПериода) КАК ОстаткиУБрокеров_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ПрочаяДебиторскаяЗадолженность_КонецПериода) КАК ПрочаяДебиторскаяЗадолженность_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ИтогоАктивов_КонецПериода) КАК ИтогоАктивов_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.КредиторскаяЗадолженность_КонецПериода) КАК КредиторскаяЗадолженность_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ВознаграждениеУК_КонецПериода) КАК ВознаграждениеУК_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ВозвратСредствУчредителю_КонецПериода) КАК ВозвратСредствУчредителю_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.КредиторскаяЗадолженностьПоЦБ_КонецПериода) КАК КредиторскаяЗадолженностьПоЦБ_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ОплатаРасходовДУ_КонецПериода) КАК ОплатаРасходовДУ_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ПрочаяКредиторскаяЗадолженность_КонецПериода) КАК ПрочаяКредиторскаяЗадолженность_КонецПериода,
	|	СУММА(_РаспределениеНеЦБ_КонецПериода.ИтогоПассивов_КонецПериода) КАК ИтогоПассивов_КонецПериода
	|ПОМЕСТИТЬ _РаспределениеНеЦБ_КонецПериода_Итоги
	|ИЗ
	|	_РаспределениеНеЦБ_КонецПериода КАК _РаспределениеНеЦБ_КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(_АктивыНеЦБ_НачалоПериода.СубъектАналитики КАК Справочник.БрокерскиеКомпании).ЮрФизЛицо КАК Брокер,
	|	_АктивыНеЦБ_НачалоПериода.Сумма КАК Брокер_НачалоПериода,
	|	0 КАК Брокер_КонецПериода
	|ПОМЕСТИТЬ _Брокеры_Развернуто
	|ИЗ
	|	_АктивыНеЦБ_НачалоПериода КАК _АктивыНеЦБ_НачалоПериода
	|ГДЕ
	|	_АктивыНеЦБ_НачалоПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|	И ТИПЗНАЧЕНИЯ(_АктивыНеЦБ_НачалоПериода.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(_АктивыНеЦБ_КонецПериода.СубъектАналитики КАК Справочник.БрокерскиеКомпании).ЮрФизЛицо,
	|	0,
	|	_АктивыНеЦБ_КонецПериода.Сумма
	|ИЗ
	|	_АктивыНеЦБ_КонецПериода КАК _АктивыНеЦБ_КонецПериода
	|ГДЕ
	|	_АктивыНеЦБ_КонецПериода.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|	И ТИПЗНАЧЕНИЯ(_АктивыНеЦБ_КонецПериода.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу КАК НаименованиеУК,
	|	РеквизитыКлиента.ПолноеНаименованиеПоУставу КАК НаименованиеКлиента,
	|	РеквизитыАнкетныеФОГФ.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеФОГФ,
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораДУ,
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаДоговораДУ,
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ИЗ
	|	_СчетаДоверительногоУправления КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончания,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Организация = &Организация) КАК РеквизитыКлиента
	|		ПО (РеквизитыКлиента.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.Клиент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончания,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Организация = &Организация) КАК РеквизитыОрганизации
	|		ПО (РеквизитыОрганизации.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончания,
	|				Организация = &Организация
	|					И ЮрФизЛицо = &ФОГФ
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыАнкетныеФОГФ
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыКлиента.КраткоеНаименованиеПоУставу КАК Брокер,
	|	СУММА(_Брокеры_Развернуто.Брокер_НачалоПериода) КАК Брокер_НачалоПериода,
	|	СУММА(_Брокеры_Развернуто.Брокер_КонецПериода) КАК Брокер_КонецПериода
	|ИЗ
	|	_Брокеры_Развернуто КАК _Брокеры_Развернуто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				&ДатаОкончания,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыКлиента
	|		ПО (РеквизитыКлиента.ЮрФизЛицо = _Брокеры_Развернуто.Брокер)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеквизитыКлиента.КраткоеНаименованиеПоУставу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ДенежныеСредства_НачалоПериода, 0) КАК ДенежныеСредства_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ДенежныеСредстваРуб_НачалоПериода, 0) КАК ДенежныеСредстваРуб_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ДенежныеСредстваВал_НачалоПериода, 0) КАК ДенежныеСредстваВал_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.Депозиты_НачалоПериода, 0) КАК Депозиты_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ДебиторскаяЗадолженность_НачалоПериода, 0) КАК ДебиторскаяЗадолженность_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ЗадолженностьПоЦБ_НачалоПериода, 0) КАК ЗадолженностьПоЦБ_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ПроцентыИДивиденды_НачалоПериода, 0) КАК ПроцентыИДивиденды_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ОстаткиУБрокеров_НачалоПериода, 0) КАК ОстаткиУБрокеров_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ПрочаяДебиторскаяЗадолженность_НачалоПериода, 0) КАК ПрочаяДебиторскаяЗадолженность_НачалоПериода,
	|	ЕСТЬNULL(_СтоимостьПереоценки_НачалоПериода.Сумма, 0) + ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ИтогоАктивов_НачалоПериода, 0) КАК ИтогоАктивов_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.КредиторскаяЗадолженность_НачалоПериода, 0) КАК КредиторскаяЗадолженность_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ВознаграждениеУК_НачалоПериода, 0) КАК ВознаграждениеУК_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ВозвратСредствУчредителю_НачалоПериода, 0) КАК ВозвратСредствУчредителю_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.КредиторскаяЗадолженностьПоЦБ_НачалоПериода, 0) КАК КредиторскаяЗадолженностьПоЦБ_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ОплатаРасходовДУ_НачалоПериода, 0) КАК ОплатаРасходовДУ_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ПрочаяКредиторскаяЗадолженность_НачалоПериода, 0) КАК ПрочаяКредиторскаяЗадолженность_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ИтогоПассивов_НачалоПериода, 0) КАК ИтогоПассивов_НачалоПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ДенежныеСредства_КонецПериода, 0) КАК ДенежныеСредства_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ДенежныеСредстваРуб_КонецПериода, 0) КАК ДенежныеСредстваРуб_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ДенежныеСредстваВал_КонецПериода, 0) КАК ДенежныеСредстваВал_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.Депозиты_КонецПериода, 0) КАК Депозиты_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ДебиторскаяЗадолженность_КонецПериода, 0) КАК ДебиторскаяЗадолженность_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ЗадолженностьПоЦБ_КонецПериода, 0) КАК ЗадолженностьПоЦБ_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ПроцентыИДивиденды_КонецПериода, 0) КАК ПроцентыИДивиденды_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ОстаткиУБрокеров_КонецПериода, 0) КАК ОстаткиУБрокеров_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ПрочаяДебиторскаяЗадолженность_КонецПериода, 0) КАК ПрочаяДебиторскаяЗадолженность_КонецПериода,
	|	ЕСТЬNULL(_СтоимостьПереоценки_КонецПериода.Сумма, 0) + ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ИтогоАктивов_КонецПериода, 0) КАК ИтогоАктивов_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.КредиторскаяЗадолженность_КонецПериода, 0) КАК КредиторскаяЗадолженность_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ВознаграждениеУК_КонецПериода, 0) КАК ВознаграждениеУК_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ВозвратСредствУчредителю_КонецПериода, 0) КАК ВозвратСредствУчредителю_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.КредиторскаяЗадолженностьПоЦБ_КонецПериода, 0) КАК КредиторскаяЗадолженностьПоЦБ_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ОплатаРасходовДУ_КонецПериода, 0) КАК ОплатаРасходовДУ_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ПрочаяКредиторскаяЗадолженность_КонецПериода, 0) КАК ПрочаяКредиторскаяЗадолженность_КонецПериода,
	|	ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ИтогоПассивов_КонецПериода, 0) КАК ИтогоПассивов_КонецПериода,
	|	ЕСТЬNULL(_БалансоваяСтоимостьЦБ_КонецПериода.БалансоваяСумма, 0) КАК ФинансовыеВложения_Баланс_КонецПериода,
	|	ЕСТЬNULL(_БалансоваяСтоимостьЦБ_НачалоПериода.БалансоваяСумма, 0) КАК ФинансовыеВложения_Баланс_НачалоПериода,
	|	ЕСТЬNULL(_СтоимостьПереоценки_КонецПериода.Сумма, 0) КАК ФинансовыеВложения_КонецПериода,
	|	ЕСТЬNULL(_СтоимостьПереоценки_НачалоПериода.Сумма, 0) КАК ФинансовыеВложения_НачалоПериода,
	|	ЕСТЬNULL(_СтоимостьПереоценки_НачалоПериода.Сумма, 0) - ЕСТЬNULL(_БалансоваяСтоимостьЦБ_НачалоПериода.БалансоваяСумма, 0) КАК ФинансовыеВложения_Отклонение_НачалоПериода,
	|	ЕСТЬNULL(_СтоимостьПереоценки_КонецПериода.Сумма, 0) - ЕСТЬNULL(_БалансоваяСтоимостьЦБ_КонецПериода.БалансоваяСумма, 0) КАК ФинансовыеВложения_Отклонение_КонецПериода,
	|	ЕСТЬNULL(_СтоимостьПереоценки_НачалоПериода.Сумма, 0) + ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ИтогоАктивов_НачалоПериода, 0) - ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ИтогоПассивов_НачалоПериода, 0) КАК СЧА_НачалоПериода,
	|	ЕСТЬNULL(_СтоимостьПереоценки_КонецПериода.Сумма, 0) + ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ИтогоАктивов_КонецПериода, 0) - ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ИтогоПассивов_КонецПериода, 0) КАК СЧА_КонецПериода,
	|	ЕСТЬNULL(_ВводыВыводы.ПоступлениеАктивов, 0) КАК ПоступлениеАктивов,
	|	ЕСТЬNULL(_ВводыВыводы.ИзъятиеАктивов, 0) КАК ИзъятиеАктивов,
	|	ЕСТЬNULL(_СтоимостьПереоценки_КонецПериода.Сумма, 0) + ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ИтогоАктивов_КонецПериода, 0) - ЕСТЬNULL(_РаспределениеНеЦБ_КонецПериода_Итоги.ИтогоПассивов_КонецПериода, 0) - ЕСТЬNULL(_ВводыВыводы.ПоступлениеАктивов, 0) + ЕСТЬNULL(_ВводыВыводы.ИзъятиеАктивов, 0) - (ЕСТЬNULL(_СтоимостьПереоценки_НачалоПериода.Сумма, 0) + ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ИтогоАктивов_НачалоПериода, 0) - ЕСТЬNULL(_РаспределениеНеЦБ_НачалоПериода_Итоги.ИтогоПассивов_НачалоПериода, 0)) КАК ПриростИмущества
	|ИЗ
	|	_РаспределениеНеЦБ_НачалоПериода_Итоги КАК _РаспределениеНеЦБ_НачалоПериода_Итоги
	|		ПОЛНОЕ СОЕДИНЕНИЕ _РаспределениеНеЦБ_КонецПериода_Итоги КАК _РаспределениеНеЦБ_КонецПериода_Итоги
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ _БалансоваяСтоимостьЦБ_НачалоПериода КАК _БалансоваяСтоимостьЦБ_НачалоПериода
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ _БалансоваяСтоимостьЦБ_КонецПериода КАК _БалансоваяСтоимостьЦБ_КонецПериода
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ _СтоимостьПереоценки_НачалоПериода КАК _СтоимостьПереоценки_НачалоПериода
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ _СтоимостьПереоценки_КонецПериода КАК _СтоимостьПереоценки_КонецПериода
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
	|		ПО (ИСТИНА)";
	
	#КОНЕЦОБЛАСТИ 
	
	Запрос.УстановитьПараметр("ДатаНачала", 					ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 					КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидПоказателя", 					Справочники.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок);
	Запрос.УстановитьПараметр("ДатаОкончания_Граница", 			Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая)); 
	Запрос.УстановитьПараметр("ДатаСЧАНаНачалоПериода", 		ДатаСЧАНаНачалоПериода);
	Запрос.УстановитьПараметр("ДатаСЧАНаКонецПериода", 			ДатаСЧАНаКонецПериода);
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Организация, "ВалютаУчета, ЮрФизЛицо");
	
	Запрос.УстановитьПараметр("ВалютаУчета",					РеквизитыОрганизации.ВалютаУчета);
	Запрос.УстановитьПараметр("ЮрФизЛицо",						РеквизитыОрганизации.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ВидУчетаБаланс",					Перечисления.ВидыУчета.БухгалтерскийУчет);
	Запрос.УстановитьПараметр("ФОГФ",						  	ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ФОГФ"));
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ИндексПоследнегозапроса = ПакетЗапросов.ВГраница();
	
	// Секция 1
	Выборка = ПакетЗапросов[ИндексПоследнегоЗапроса - 2].Выбрать();

	НаименованиеКлиента = "";
	НаименованиеУК		= "";
	Если Выборка.Следующий() Тогда				
		ОбластьСекция_1.Параметры.Заполнить(Выборка);
		ОбластьСекция_1.Параметры.ПолноеНаименованиеФОГФРП = ПолучитьСклоненияСтроки(Выборка.ПолноеНаименованиеФОГФ, "", "ПД=Родительный")[0];
	КонецЕсли;
	
	ОбластьСекция_1.Параметры.ДатаОтчета 			= Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");	
	
	Выборка = ПакетЗапросов[ИндексПоследнегоЗапроса].Выбрать();
	Если Выборка.Следующий() Тогда                   		
		ОбластьСекция_1.Параметры.Заполнить(Выборка);
		ОбластьСекция_2.Параметры.Заполнить(Выборка);
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьСекция_1);
	
	// Секция Брокеры
	ВыборкаБрокеры = ПакетЗапросов[ИндексПоследнегоЗапроса - 1].Выбрать();
	Пока ВыборкаБрокеры.Следующий() Цикл
		ОбластьБрокеры.Параметры.Заполнить(ВыборкаБрокеры);
		ДокументРезультат.Вывести(ОбластьБрокеры);
	КонецЦикла;
	
	// Секция 2
	ДокументРезультат.Вывести(ОбластьСекция_2);
	
	// Подписи	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
	ОбластьПодвал.Параметры.Ответственный 		= СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	ОбластьПодвал.Параметры.ДолжностьДиректор 	= СтруктураДанныхКонтактногоЛица.Должность + " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий +  ")";

	ОбластьПодвал.Параметры.ГлавныйБухгалтер 	= СтруктураДанныхГлБухгалтера.КонтактноеЛицо;
	ОбластьПодвал.Параметры.ДолжностьГлавбух    = СтруктураДанныхГлБухгалтера.Должность;
	
	ДокументРезультат.Вывести(ОбластьПодвал);
		
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение операции
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры
